view/cat/app/controllers/kitties_controller.rb

SELECT "kitties".* FROM "kitties"
---
  def index
    @kitties = Kitty.all