view/guide/lab/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "first "], ["content", "aaaaaaaa"], ["created_at", "2021-09-05 16:10:52.319747"], ["updated_at", "2021-09-05 16:10:52.319747"]]

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:id])

    if @post.update
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "beeeeeeeeb"], ["updated_at", "2021-09-06 13:16:23.273488"], ["id", 6]]

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]