view/lib/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def show
    @book = Book.find_by(id: params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def edit
    @book = Book.find_by(id: params[:id])