auth/catt/app/controllers/cats_controller.rb

  def index
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    @cat = Cat.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @cat = current_user.cats.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "sex", "name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"